HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/channel395DFSEM/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType LES;

LES
{
    turbulence      on;

    LESModel        kEqn;
    kEqnCoeffs
    {
        Ce              1.048;
        Ck              0.07; // 0.094;
    }

    printCoeffs     on;

    delta           vanDriest;
    vanDriestCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        Aplus           26;
        Cdelta          0.158;
    }
}


// ************************************************************************* //
