HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/channel395DFSEM/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

// Re = 395, L = pi, utau = 1, nu = pi/395 = 7.9534e-3
// Ub/utau = 17.55
internalField   uniform ( 17.55 0 0 );

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    sides_half0
    {
        type            cyclic;
    }
    sides_half1
    {
        type            cyclic;
    }
    inlet
    {
        type            turbulentDFSEMInlet;
        delta           2;
        nCellPerEddy    1;
        mapMethod       nearestCell;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
