HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/channel395DFSEM/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

#- Run serial
#runApplication $(getApplication)

#- Run parallel
runApplication decomposePar -cellDist
runParallel $(getApplication)
#runApplication reconstructPar -latestTime

# -----------------------------------------------------------------------------
